
# Узнайте у пользователя число n
n = input('Введите число : ')

# Найдите сумму чисел n + nn + nnn
nn = n*2
nnn = n*3
a = int(n) + int(nn) + int(nnn)

print(a)
